## Terraform Plan for Staging Environment

**Environment**: Staging
**Platform**: Serverless (Lambda + API Gateway)
**Workspace**: staging
**Branch**: develop
**Triggered by**: PR #154
  
  <details><summary>Click to expand plan</summary>
  
  ```hcl
  
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_key_pair.environment_key will be created
  + resource "aws_key_pair" "environment_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "tf-playground-staging-key"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = (sensitive value)
      + tags            = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "tf-playground-staging-key"
          + "Project"     = "tf-playground"
          + "Purpose"     = "centralized-ssh-key"
        }
      + tags_all        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "tf-playground-staging-key"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Purpose"     = "centralized-ssh-key"
          + "Tier"        = "staging"
        }
    }

  # module.logging.aws_cloudwatch_dashboard.main will be created
  + resource "aws_cloudwatch_dashboard" "main" {
      + dashboard_arn  = (known after apply)
      + dashboard_body = jsonencode(
            {
              + widgets = [
                  + {
                      + height     = 6
                      + properties = {
                          + query  = <<-EOT
                                SOURCE '/aws/application/tf-playground/staging'
                                | fields @timestamp, @message
                                | sort @timestamp desc
                                | limit 20
                            EOT
                          + region = "us-east-2"
                          + title  = "Recent Application Logs"
                        }
                      + type       = "log"
                      + width      = 12
                      + x          = 0
                      + y          = 0
                    },
                  + {
                      + height     = 6
                      + properties = {
                          + query  = <<-EOT
                                SOURCE '/aws/application/tf-playground/staging'
                                | filter @message like /ERROR/
                                | fields @timestamp, @message
                                | sort @timestamp desc
                                | limit 10
                            EOT
                          + region = "us-east-2"
                          + title  = "Recent Errors"
                        }
                      + type       = "log"
                      + width      = 12
                      + x          = 0
                      + y          = 6
                    },
                ]
            }
        )
      + dashboard_name = "tf-playground-staging"
      + id             = (known after apply)
    }

  # module.networking.aws_internet_gateway.main will be created
  + resource "aws_internet_gateway" "main" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-igw"
          + "Project"     = "tf-playground"
        }
      + tags_all = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-igw"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "staging"
        }
      + vpc_id   = (known after apply)
    }

  # module.networking.aws_route_table.public will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = [
          + {
              + cidr_block                 = "0.0.0.0/0"
              + gateway_id                 = (known after apply)
                # (11 unchanged attributes hidden)
            },
        ]
      + tags             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-rt"
          + "Project"     = "tf-playground"
        }
      + tags_all         = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-rt"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "staging"
        }
      + vpc_id           = (known after apply)
    }

  # module.networking.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.networking.aws_security_group.alb will be created
  + resource "aws_security_group" "alb" {
      + arn                    = (known after apply)
      + description            = "Security group for Application Load Balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTP traffic from internet"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow HTTPS traffic from internet"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
        ]
      + name                   = "staging-alb-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-alb-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-alb-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "staging"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.database will be created
  + resource "aws_security_group" "database" {
      + arn                    = (known after apply)
      + description            = "Security group for RDS database (MySQL from webservers)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "staging-database-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-database-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "staging"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group.webserver will be created
  + resource "aws_security_group" "webserver" {
      + arn                    = (known after apply)
      + description            = "Security group for web servers (HTTP, SSH, egress)"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "Allow all outbound traffic"
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "staging-webserver-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-webserver-sg"
          + "Project"     = "tf-playground"
        }
      + tags_all               = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-webserver-sg"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "staging"
        }
      + vpc_id                 = (known after apply)
    }

  # module.networking.aws_security_group_rule.webserver_alb_ingress will be created
  + resource "aws_security_group_rule" "webserver_alb_ingress" {
      + description              = "Allow HTTP traffic on port 8080 from ALB"
      + from_port                = 8080
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 8080
      + type                     = "ingress"
    }

  # module.networking.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-subnet-1"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-subnet-1"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "staging"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-2b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-subnet-2"
          + "Project"     = "tf-playground"
        }
      + tags_all                                       = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-public-subnet-2"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "staging"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.networking.aws_vpc.main will be created
  + resource "aws_vpc" "main" {
      + arn                                  = (known after apply)
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-vpc"
          + "Project"     = "tf-playground"
        }
      + tags_all                             = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "staging-vpc"
          + "Pipeline"    = "gitflow-cicd"
          + "Project"     = "tf-playground"
          + "Tier"        = "staging"
        }
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + application_log_group_name       = "/aws/application/tf-playground/staging"
  + application_url                  = "No load balancer configured"
  + cloudwatch_dashboard_url         = "https://console.aws.amazon.com/cloudwatch/home?region=us-east-2#dashboards:name=tf-playground-staging"
  + db_username                      = "tfplayground_user"
  + deployment_timestamp             = "Deployed via GitFlow CI/CD - Staging Environment"
  + deployment_validation_url        = "No load balancer configured"
  + environment_summary              = {
      + alb_dns_name      = null
      + application_url   = "No load balancer configured"
      + blue_asg_name     = null
      + database_endpoint = "serverless-architecture"
      + environment       = "staging"
      + green_asg_name    = null
      + region            = "us-east-2"
      + ssh_key_name      = "tf-playground-staging-key"
      + vpc_id            = (known after apply)
    }
  + global_alarm_log_group_arn       = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/cloudwatch/alarms/tf-playground/staging"
  + global_application_log_group_arn = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/application/tf-playground/staging"
  + global_log_group_arns            = {
      + alarm       = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/cloudwatch/alarms/tf-playground/staging"
      + application = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/application/tf-playground/staging"
      + system      = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/ec2/tf-playground/staging"
    }
  + global_system_log_group_arn      = "arn:aws:logs:us-east-2:123324351829:log-group:/aws/ec2/tf-playground/staging"
  + health_check_url                 = "No load balancer configured"
  + private_subnet_ids               = []
  + public_subnet_ids                = [
      + (known after apply),
      + (known after apply),
    ]
  + ssh_key_name                     = "tf-playground-staging-key"
  + ssh_private_key                  = (sensitive value)
  + ssh_public_key                   = (sensitive value)
  + system_log_group_name            = "/aws/ec2/tf-playground/staging"
  + vpc_id                           = (known after apply)

  ```
  
  </details>